app/Http/Controllers/PlantaController.php

select "id", "nome_popular", "especie", "e_apicola", "e_panc", "e_forrageira" from "plantas" where "nome_popular"::text ILIKE '%%' order by "nome_popular" asc limit 10 offset 0
select count(*) as aggregate from "plantas" where "nome_popular"::text ILIKE '%%'
---
    public function index()
    {
//$plantas = Planta::paginate(10); // ou ->simplePaginate(10)

//return view('plantas.index', compact('plantas'));
//   return view('plantas.index', ['plantas' => Planta::all()]);
    // Carrega apenas os relacionamentos necessários
    $plantas = Planta::with(['floracoes:id,mes_floracao','frutos:id,mes_frutos','classificacoes:id,classificacao', 'imagens:id,id_planta,caminho'])
        ->select(['id', 'nome_popular', 'especie', 'e_apicola', 'e_panc','e_forrageira'])
        ->where('nome_popular', 'ILIKE', "%".request('search')."%")
        ->orderBy('nome_popular')
        ->paginate(10); // Reduza o número de itens por página

select * from "plantas"
---
    public function list()
    {
        return view('planta.index', ['plantas' => Planta::all()]);

select "observacoes".*, "observacoes_registro"."registro_id" as "pivot_registro_id", "observacoes_registro"."observacoes_id" as "pivot_observacoes_id" from "observacoes" inner join "observacoes_registro" on "observacoes"."id" = "observacoes_registro"."observacoes_id" where "observacoes_registro"."registro_id" in (1)
select "crescimento".*, "planta_crescimento"."planta_id" as "pivot_planta_id", "planta_crescimento"."crescimento_id" as "pivot_crescimento_id" from "crescimento" inner join "planta_crescimento" on "crescimento"."id" = "planta_crescimento"."crescimento_id" where "planta_crescimento"."planta_id" in (0)
select "fruto".*, "planta_fruto"."planta_id" as "pivot_planta_id", "planta_fruto"."fruto_id" as "pivot_fruto_id" from "fruto" inner join "planta_fruto" on "fruto"."id" = "planta_fruto"."fruto_id" where "planta_fruto"."planta_id" in (0)
select "nativa".*, "planta_nativa"."planta_id" as "pivot_planta_id", "planta_nativa"."nativa_id" as "pivot_nativa_id" from "nativa" inner join "planta_nativa" on "nativa"."id" = "planta_nativa"."nativa_id" where "planta_nativa"."planta_id" in (0)
---
    public function show(Planta $planta)
    {
        $planta->load([
            'classificacoes',
            'nativas',
            'crescimentos',
            'floracoes',
            'frutos',
            'produtividades',
            'imagens',
            'registros' => function($query) {
                $query->with('usuario', 'observacoes');
            }
        ]);

select "crescimento".*, "planta_crescimento"."planta_id" as "pivot_planta_id", "planta_crescimento"."crescimento_id" as "pivot_crescimento_id" from "crescimento" inner join "planta_crescimento" on "crescimento"."id" = "planta_crescimento"."crescimento_id" where "planta_crescimento"."planta_id" in (23)
select "fruto".*, "planta_fruto"."planta_id" as "pivot_planta_id", "planta_fruto"."fruto_id" as "pivot_fruto_id" from "fruto" inner join "planta_fruto" on "fruto"."id" = "planta_fruto"."fruto_id" where "planta_fruto"."planta_id" in (23)
select "nativa".*, "planta_nativa"."planta_id" as "pivot_planta_id", "planta_nativa"."nativa_id" as "pivot_nativa_id" from "nativa" inner join "planta_nativa" on "nativa"."id" = "planta_nativa"."nativa_id" where "planta_nativa"."planta_id" in (23)
select "produtividade".*, "planta_produtividade"."planta_id" as "pivot_planta_id", "planta_produtividade"."produtividade_id" as "pivot_produtividade_id" from "produtividade" inner join "planta_produtividade" on "produtividade"."id" = "planta_produtividade"."produtividade_id" where "planta_produtividade"."planta_id" in (23)
select * from "classificacao"
select * from "nativa"
select * from "crescimento"
select * from "floracao"
select * from "fruto"
select * from "produtividade"
---
    public function edit(Planta $planta)
    {
        $planta->load(['classificacoes', 'nativas', 'crescimentos', 'floracoes', 'frutos', 'produtividades']);

        $classificacoes = Classificacao::all();
        $nativas = Nativa::all();
        $crescimentos = Crescimento::all();
        $floracoes = Floracao::all();
        $frutos = Fruto::all();
        $produtividades = Produtividade::all();

select * from "plantas" where "plantas"."id" = '14' limit 1
---
    public function judit($id)
    {

    $planta = Planta::find($id);

update "plantas" set "nome_cientifico" = 'Eucalyptus globulus', "e_apicola" = 1, "e_panc" = 0, "e_forrageira" = 0, "updated_at" = '2025-05-21 02:16:37' where "id" = 23
select * from "plantas" where "plantas"."id" = '14' limit 1
---
*/
        ]);

        $planta->update($validated);

        $planta = Planta::findOrFail($request->id);

update "plantas" set "e_apicola" = 0, "e_panc" = 1, "e_forrageira" = 1, "updated_at" = '2025-05-21 16:31:26' where "id" = 14
---
        $planta->e_apicola       = $request->e_apicola;
        $planta->e_forrageira    = $request->e_forrageira;
        $planta->e_panc    = $request->e_panc;
        $planta->save();

delete from "plantas" where "id" = 1
---
    public function destroy(Planta $planta)
    {
        // Delete associated images
        foreach ($planta->imagens as $imagem) {
            Storage::delete($imagem->caminho);
            $imagem->delete();
        }

        $planta->delete();