app/Http/Controllers/RegistroController.php

    public function index()
    {
        $registros = Registro::with(['plantas', 'usuario', 'observacoes'])
            ->where('id_usuario', 'LIKE', "".auth()->id()."")
            ->orderBy('data', 'desc')
            ->paginate(10);
---
select "observacoes".*, "observacoes_registro"."registro_id" as "pivot_registro_id", "observacoes_registro"."observacoes_id" as "pivot_observacoes_id" from "observacoes" inner join "observacoes_registro" on "observacoes"."id" = "observacoes_registro"."observacoes_id" where "observacoes_registro"."registro_id" in (1, 2)
select "plantas".*, "planta_registro"."registro_id" as "pivot_registro_id", "planta_registro"."planta_id" as "pivot_planta_id" from "plantas" inner join "planta_registro" on "plantas"."id" = "planta_registro"."planta_id" where "planta_registro"."registro_id" in (1, 2)
select * from "registro" where "id_usuario"::text LIKE '1' order by "data" desc limit 10 offset 0
select count(*) as aggregate from "registro" where "id_usuario"::text LIKE '1'

    public function create()
    {
        $plantas = Planta::orderBy('nome_popular')->get();
---
select * from "plantas" order by "nome_popular" asc

    public function store(Request $request)
    {
        $validated = $request->validate([
            'id_planta' => 'required|exists:plantas,id',
            'descricao' => 'required|string',
            'lat' => 'required|numeric',
            'lon' => 'required|numeric',
            'tipo' => 'required|in:A,F,P', // A=Avistamento, F=Floração, P=Fruto
            'observacao' => 'nullable|string',
            'imagem_observacao' => 'nullable|image|mimes:jpeg,png,jpg,gif|max:2048'
        ]);

        // Create registro
        $registro = Registro::create([
            'id_planta' => $validated['id_planta'],
            'id_usuario' => Auth::id(),
            'descricao' => $validated['descricao'],
            'lat' => $validated['lat'],
            'lon' => $validated['lon'],
            'tipo' => $validated['tipo']
        ]);
---
insert into "registro" ("id_planta", "id_usuario", "descricao", "lat", "lon", "tipo", "updated_at", "created_at") values ('14', 1, 'erer', '-23.561805', '-46.640911', 'A', '2025-05-21 02:42:24', '2025-05-21 02:42:24') returning "id"

    public function show(Registro $registro)
    {
        $registro->load(['plantas', 'usuario', 'observacoes.usuario']);
---
select "observacoes".*, "observacoes_registro"."registro_id" as "pivot_registro_id", "observacoes_registro"."observacoes_id" as "pivot_observacoes_id" from "observacoes" inner join "observacoes_registro" on "observacoes"."id" = "observacoes_registro"."observacoes_id" where "observacoes_registro"."registro_id" in (1)
select "plantas".*, "planta_registro"."registro_id" as "pivot_registro_id", "planta_registro"."planta_id" as "pivot_planta_id" from "plantas" inner join "planta_registro" on "plantas"."id" = "planta_registro"."planta_id" where "planta_registro"."registro_id" in (1)

    public function edit(Registro $registro)
    {
        if ($registro->id_usuario != Auth::id() && !Auth::user()->isAdmin()) {
            abort(403, 'Acesso não autorizado');
        }

        $plantas = Planta::orderBy('nome_popular')->get();
        $registro->load(['observacoes']);
---
select * from "plantas" order by "nome_popular" asc
select * from "users" where "users"."id" in (3)
select "observacoes".*, "observacoes_registro"."registro_id" as "pivot_registro_id", "observacoes_registro"."observacoes_id" as "pivot_observacoes_id" from "observacoes" inner join "observacoes_registro" on "observacoes"."id" = "observacoes_registro"."observacoes_id" where "observacoes_registro"."registro_id" in (2)

    public function update(Request $request, Registro $registro)
    {
        if ($registro->id_usuario != Auth::id() && !Auth::user()->isAdmin()) {
            abort(403, 'Acesso não autorizado');
        }

        $validated = $request->validate([
            'id_planta' => 'required|exists:plantas,id',
            'descricao' => 'required|string',
            'lat' => 'required|numeric',
            'lon' => 'required|numeric',
            'tipo' => 'required|in:A,F,P'
        ]);

        $registro->update($validated);
---
update "registro" set "lat" = '-22.455033', "lon" = '-43.854247', "tipo" = 'A', "updated_at" = '2025-05-21 14:19:50' where "id" = 1